---
kind: other
id: Methods.T:Autodesk.Revit.DB.LocationCurve
source: html/2d0ed64b-4942-f791-cac6-0ccfff1930d9.htm
---
# LocationCurve Methods

Causes the object to release immediately any resources it may be utilizing.